#!/bin/bash
# return-test.sh

# 函数所能返回的最大正整数为255. 

return_test ()         # 传给函数什么值, 就返回什么值. 
{
  return $1
}

return_test 27         # o.k.
echo $?                # 返回27.
  
return_test 255        # 依然是o.k.
echo $?                # 返回255.

return_test 257        # 错误!
echo $?                # 返回1 (对应各种错误的返回码). 

# ======================================================
return_test -151896    # 能返回一个大负数么? 
echo $?                # 能否返回-151896?
                       # 显然不行! 只返回了168.
#  Bash 2.05b以前的版本
#+ 允许返回大负数. 
#  Bash的新版本(2.05b之后)修正了这个漏洞. 
#  这可能会影响以前所编写的脚本. 
#  一定要小心! 
# ======================================================

exit 0
