#本节的任务
'''
- 这节以及下一节的习题中不会有任何代码，所以也不会有习题答案或者加分习题。
- 其实这节习题可以说是一个巨型的加分习题。
- 我将让你完成一个表格，让你回顾 你到现在学到的所有东西。
- 首先，回到你的每一个习题的脚本里，把你碰到的每一个词和每一个符号 (symbol，character 的别名)写下来。
- 确保你的符号列表是完整的。
- 下一步，在每一个关键词和字符后面写出它的名字，并且说明它的作用。
- 如果你 在书里找不到符号的名字，就上网找一下。
- 如果你不知道某个关键字或者符号的 作用，就回到用到该字符的章节通读一下，并且在脚本中测试一下这个字符的用 处。
- 你也许会碰到一些横竖找不到答案的东西，只要把这些记在列表里，它可以提示 你让你知道还有哪些东西不懂，等下次碰到的时候，你就不会轻易跳过了。
- 你的列表做好以后，再花几天时间重写一遍这份列表，确认里边的东西都是正确 的。
- 你可能觉得这很无聊，不过你还是需要坚持完成任务。
- 等你记住了这份列表中的所有内容，就试着把这份列表默写一遍。
- 如果发现自己 漏掉或者忘记了某些内容，就回去再记一遍。

# 你学到的东西
- 这种记忆练习是枯燥无味的，所以知道它的意义很重要。
- 它会让你明确目标，让 你知道你所有努力的目的。
- 在这节练习中你学会的是各种符号的名称，这样读代码对你来说会更加容易。
- 这 和学英语时记忆字母表和基本单词的意义是一样的，不同的是 Python 中会有 一些你不熟悉的字符。
- 慢慢做，别让它成为你的负担。
- 这些符号对你来说应该比较熟悉，所以记住它们 应该不是很费力的事情。
- 你可以一次花个 15 分钟，然后休息一下。
- 作息结合 可以让你学得更快，而且可以让你保持士气。
'''
