#!/usr/bin/python
# -*- coding: utf-8 -*-
# 第36题 设计和调试
print(
'''
# If 语句的规则
1.每个if语句必须包含一个else.
2. 如果这个else永远都不应该被执行到，因为它本身没啥意义，，
那么你必须在else后使用一个叫做die到函数，让他打印出错误信息并四给你看。
3.If语句嵌套不要超过2层，尽量保持1层。如果if里还有if，那你就需要把第二个if移动到另一个函数里。
4.将if语句当作段落来对待，其中每一个if，elif,else组合就跟一个段落的句子组合一样，在这种组合的最前面和最后面留一个空行做区分。
5.你的布尔测试应该很简单，如果他们很复杂的话，你需要将她们的元算是钱放到一个变量里，并为变量取一个好名字。

# 循环的规则
1.只有在循环永不停止时候使用while循环，着意味着你可能永远都用不到，这条只在Python中成立。
2.其他类型的循环都使用“for循环”，尤其是在循环的对象数量固定或者有限的情况下。

# 调试（debug）的小技巧

1.不要使用debugger,这些只会让你更困惑。
2.最好的调试方法是使用print在你各个想要检查的关键环节，将关键变量打印出来，从而检查哪些是否有错。
3.让程序一部分一部分地运行起来。不要等一个很长的脚本写完了才去运行它，写一点，运行一点，再修改一点。

# 家庭作业
写一个和上节练习类似的游戏。同类的任何题材游戏都可以。作为加分习题，你可以尽量多使用列表 函数 模组（习题13）
先画地图，再写代码。
最后一个建议：美个程序员在开始一个新的大项目的时候，都会被非理性的恐惧影响到，为了避免这种恐惧，她们会拖延时间，到最后一事无成。我有时候也会这样，每个人都会有这样的经历，避免这种情况的最好的方法是把自己要做的事情列表出来，每次完成一样。
开始做吧。先做一个小一点的版本，扩充它让它变大，把自己要完成的事情一一列出来，然后逐个完成就可以了。
'''
)


# 运行后的结果：
'''
itifadeMacBook-Pro:~ yyy$ python


'''
